KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include <stdbool.h>
#include <string.h>
#include <limits.h>

#include "nrf_cli.h"
#include "zboss_api.h"
#include "zb_error_handler.h"
#include "zigbee_cli.h"
#include "zigbee_cli_utils.h"

/**
 * @defgroup zb_cli_cmd_zdo ZDO commands
 * @ingroup zb_cli
 *
 * @{
 */

// Defines how many ZDO requests can be run concurrently.
#define ZIGBEE_CLI_ZDO_TSN                 3
// Defines how long to wait, in seconds, for Match Descriptor Response.
#define ZIGBEE_CLI_MATCH_DESC_RESP_TIMEOUT 5
// Defines how long to wait, in seconds, for Bind Response.
#define ZIGBEE_CLI_BIND_RESP_TIMEOUT       5
// Defines how long to wait, in seconds, for Network Addrees Response.
#define ZIGBEE_CLI_NWK_ADDR_RESP_TIMEOUT   5
// Defines how long to wait, in seconds, for IEEE (EUI64) Addrees Response.
#define ZIGBEE_CLI_IEEE_ADDR_RESP_TIMEOUT  5
// Defines how long to wait, in seconds, for mgmt_leave response
#define ZIGBEE_CLI_MGMT_LEAVE_RESP_TIMEOUT  5

typedef struct {
    bool                        header_printed;
    zb_zdo_mgmt_bind_param_t    zb_zdo_mgmt_bind_param;
} ctx_mgmt_bind_t;

// This structure allows for binding ZBOSS transaction and CLI object.
typedef struct {
    nrf_cli_t const * p_cli;
    uint8_t           tsn;
    bool              taken;
    bool              is_broadcast;

    union {
        ctx_mgmt_bind_t mgmt_bind;
    } cmd_ctx;

} zdo_tsn_ctx_t;

static zdo_tsn_ctx_t m_tsn_ctx[ZIGBEE_CLI_ZDO_TSN];

/**
 * @brief Return a pointer to context with the given transaction sequence number.
 *
 * @param[in] tsn ZBOSS transaction sequence number.
 *
 * @return a pointer to context or NULL if context for given TSN wasn't found.
 */
static zdo_tsn_ctx_t * get_ctx_by_tsn(uint8_t tsn)
{
    for (uint8_t i = 0; i < ARRAY_SIZE(m_tsn_ctx); i++)
    {
        if ((m_tsn_ctx[i].taken == true) && (m_tsn_ctx[i].tsn == tsn))
        {
            return &m_tsn_ctx[i];
        }
    }

    return NULL;
}

/**
 * @brief Get a pointer to a free context.
 *
 * @return a pointer to context structure or NULL if all contexts are taken.
 */
static zdo_tsn_ctx_t * get_free_ctx(void)
{
    for (uint8_t i = 0; i < ARRAY_SIZE(m_tsn_ctx); i++)
    {
        if (!m_tsn_ctx[i].taken)
        {
            m_tsn_ctx[i].taken = true;

            return &m_tsn_ctx[i];
        }
    }

    return NULL;
}

/**
 * Invalidate context.
 *
 * @param[in] p_tsn_ctx a pointer to transaction context.
 */
static void invalidate_ctx(zdo_tsn_ctx_t * p_tsn_ctx)
{
    p_tsn_ctx->taken        = false;
    p_tsn_ctx->tsn          = 0xFF;
    p_tsn_ctx->p_cli        = NULL;
    p_tsn_ctx->is_broadcast = false;
}

/**
 * @brief Parse a list of cluster IDs.
 *
 * @param[in]  pp_argv Pointer to argument table.
 * @param[in]  num     Number of cluster IDs to scan.
 * @param[out] pp_id   Pointer to an array to store cluster IDs.
 *
 * @return 1 if parsing succeeded, 0 otherwise.
 *
 */
static int sscan_cluster_list(char ** pp_argv, uint8_t num, uint16_t * pp_id)
{
    uint16_t len = 0;

    while ((len < num) && sscanf(pp_argv[len], "%hx", pp_id))
    {
        len += 1;
        pp_id += 1;
    }

    return (len == num);
}

/**
 * @brief Handles timeout error and invalidates match descriptor request transaction.
 *
 * @param[in] param ZBOSS transaction sequence number.
 */
static void cmd_zb_match_desc_timeout(zb_uint8_t param)
{
    zdo_tsn_ctx_t * p_tsn_ctx = get_ctx_by_tsn(param);

    if (!p_tsn_ctx)
    {
        return;
    }

    print_done(p_tsn_ctx->p_cli, ZB_TRUE);
    invalidate_ctx(p_tsn_ctx);
}

/**
 * @brief A callback called on match descriptor response.
 *
 * @param[in] param Reference number to ZBOSS memory buffer.
 */
static void cmd_zb_match_desc_cb(zb_uint8_t param)
{
    zb_buf_t                   * p_buf        = ZB_BUF_FROM_REF(param);
    zb_zdo_match_desc_resp_t   * p_resp       = (zb_zdo_match_desc_resp_t *)ZB_BUF_BEGIN(p_buf);
    zb_apsde_data_indication_t * p_ind        = ZB_GET_BUF_PARAM(p_buf, zb_apsde_data_indication_t);
    zdo_tsn_ctx_t              * p_tsn_ctx;

