KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    
    if (p_tsn_ctx)
    {
        if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
        {
            zb_uint8_t * p_match_ep = (zb_uint8_t *)(p_resp + 1);

            while (p_resp->match_len > 0)
            {
                /* Match EP list follows right after response header */
                nrf_cli_fprintf(p_tsn_ctx->p_cli,
                                NRF_CLI_NORMAL,
                                "src_addr=%0hx ep=%d\r\n",
                                p_ind->src_addr,
                                *p_match_ep);

                p_match_ep += 1;
                p_resp->match_len -= 1;
            }

            if (!p_tsn_ctx->is_broadcast)
            {
                print_done(p_tsn_ctx->p_cli, ZB_TRUE);
                invalidate_ctx(p_tsn_ctx);
            }
        }
        else if (p_resp->status == ZB_ZDP_STATUS_TIMEOUT)
        {
            print_done(p_tsn_ctx->p_cli, ZB_TRUE);
            invalidate_ctx(p_tsn_ctx);
        }
    }

    ZB_FREE_BUF_BY_REF(param);
}

static zb_void_t cmd_zb_active_ep_cb(zb_uint8_t param)
{
    zb_buf_t         * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_ep_resp_t * p_resp = (zb_zdo_ep_resp_t *)ZB_BUF_BEGIN(p_buf);
    zdo_tsn_ctx_t    * p_tsn_ctx;

    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    if (!p_tsn_ctx)
    {
        ZB_FREE_BUF_BY_REF(param);
        return;
    }

    if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
    {
        nrf_cli_fprintf(p_tsn_ctx->p_cli,
                        NRF_CLI_NORMAL,
                        "src_addr=%0hx ",
                        p_resp->nwk_addr);

        PRINT_LIST(p_tsn_ctx->p_cli, "ep=", "%d", zb_uint8_t, 
                   (zb_uint8_t *)p_resp + sizeof(zb_zdo_ep_resp_t),
                   p_resp->ep_count);

        print_done(p_tsn_ctx->p_cli, ZB_TRUE);
    }
    else
    {
        print_error(p_tsn_ctx->p_cli,
                    "active ep request failed");
    }

    invalidate_ctx(p_tsn_ctx);
    ZB_FREE_BUF_BY_REF(param);
}

static zb_void_t cmd_zb_simple_desc_req_cb(zb_uint8_t param)
{
    zdo_tsn_ctx_t             * p_tsn_ctx;
    zb_buf_t                  * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_simple_desc_resp_t * p_resp = (zb_zdo_simple_desc_resp_t *)ZB_BUF_BEGIN(p_buf);
    
    zb_uint8_t    in_cluster_cnt  = p_resp->simple_desc.app_input_cluster_count;
    zb_uint8_t    out_cluster_cnt = p_resp->simple_desc.app_output_cluster_count;
    zb_uint16_t * p_cluster_list  = (zb_uint16_t *)p_resp->simple_desc.app_cluster_list;    

    p_tsn_ctx = get_ctx_by_tsn(p_resp->hdr.tsn);
    if (!p_tsn_ctx)
    {
        ZB_FREE_BUF_BY_REF(param);
        return;
    }

    if (p_resp->hdr.status == ZB_ZDP_STATUS_SUCCESS)
    {
        nrf_cli_fprintf(p_tsn_ctx->p_cli,
                        NRF_CLI_NORMAL,
                        "src_addr=0x%0hx ep=0x%d profile_id=0x%04hx app_dev_id=0x%0hx app_dev_ver=0x%0hx ",
                        p_resp->hdr.nwk_addr,
                        p_resp->simple_desc.app_profile_id,
                        p_resp->simple_desc.app_device_id,
                        p_resp->simple_desc.app_device_version);
        
        PRINT_LIST(p_tsn_ctx->p_cli, "in_clusters=", "0x%04hx", zb_uint16_t,
                   p_cluster_list, in_cluster_cnt);

        PRINT_LIST(p_tsn_ctx->p_cli, "out_clusters=", "0x%04hx", zb_uint16_t,
                   p_cluster_list + in_cluster_cnt, out_cluster_cnt);
        
        print_done(p_tsn_ctx->p_cli, ZB_TRUE);
    }
    else
    {
        print_error(p_tsn_ctx->p_cli,
                    "active ep request failed");
    }

    invalidate_ctx(p_tsn_ctx);
    ZB_FREE_BUF_BY_REF(param);
}

/**
 * @brief Handles timeout error and invalidates binding transaction.
 *
 * @param[in] param ZBOSS transaction sequence number.
 */
static void cmd_zb_bind_unbind_timeout(zb_uint8_t param)
{
    zdo_tsn_ctx_t * p_tsn_ctx = get_ctx_by_tsn(param);

    if (!p_tsn_ctx)
    {
        return;
    }

    print_error(p_tsn_ctx->p_cli, "Bind/unbind request timed out");
    invalidate_ctx(p_tsn_ctx);
}

/**
 * @brief A callback called on bind/unbind response.
 *
 * @param[in] param Reference number to ZBOSS memory buffer.
 */
zb_void_t cmd_zb_bind_unbind_cb(zb_uint8_t param)
{
    zb_buf_t           * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_bind_resp_t * p_resp = (zb_zdo_bind_resp_t *)ZB_BUF_BEGIN(p_buf);
    zdo_tsn_ctx_t      * p_tsn_ctx;
    zb_ret_t             zb_err_code;

    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    if (!p_tsn_ctx)
    {
        ZB_FREE_BUF_BY_REF(param);
        return;
    }

    zb_err_code = ZB_SCHEDULE_ALARM_CANCEL(cmd_zb_bind_unbind_timeout, ZB_ALARM_ANY_PARAM);
    if (zb_err_code != RET_OK)
    {
        print_error(p_tsn_ctx->p_cli, "Unable to cancel timeout timer");
    }

    if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
    {
        print_done(p_tsn_ctx->p_cli, ZB_TRUE);
    }
    else
    {
        nrf_cli_fprintf(p_tsn_ctx->p_cli,
                        NRF_CLI_ERROR,
                        "Error: Unable to modify binding. Status: %d\r\n",
                        p_resp->status);
    }

    invalidate_ctx(p_tsn_ctx);
    ZB_FREE_BUF_BY_REF(param);
}

/**
 * @brief Handles timeout error and invalidates network address request transaction.
 *
 * @param[in] param ZBOSS transaction sequence number.
 */
static void cmd_zb_nwk_addr_timeout(zb_uint8_t param)
{
    zdo_tsn_ctx_t * p_tsn_ctx = get_ctx_by_tsn(param);

    if (!p_tsn_ctx)
    {
        return;
    }

    print_error(p_tsn_ctx->p_cli, "Network address request timed out");
    invalidate_ctx(p_tsn_ctx);
}

/**
 * @brief A callback called on network address response.
 *
 * @param[in] param Reference number to ZBOSS memory buffer.
 */
zb_void_t cmd_zb_nwk_addr_cb(zb_uint8_t param)
{
    zb_buf_t                    * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_nwk_addr_resp_head_t * p_resp = (zb_zdo_nwk_addr_resp_head_t *)ZB_BUF_BEGIN(p_buf);
    zdo_tsn_ctx_t               * p_tsn_ctx;
    zb_ret_t                      zb_err_code;

