KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    if (!p_tsn_ctx)
    {
        ZB_FREE_BUF_BY_REF(param);
        return;
    }

    zb_err_code = ZB_SCHEDULE_ALARM_CANCEL(cmd_zb_nwk_addr_timeout, ZB_ALARM_ANY_PARAM);
    if (zb_err_code != RET_OK)
    {
        print_error(p_tsn_ctx->p_cli, "Unable to cancel timeout timer");
    }

    if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
    {
        zb_uint16_t nwk_addr;

        ZB_LETOH16(&nwk_addr, &(p_resp->nwk_addr));
        nrf_cli_fprintf(p_tsn_ctx->p_cli,
                        NRF_CLI_NORMAL,
                        "%hx",
                        nwk_addr);
        print_done(p_tsn_ctx->p_cli, ZB_TRUE);
    }
    else
    {
        nrf_cli_fprintf(p_tsn_ctx->p_cli,
                        NRF_CLI_ERROR,
                        "Error: Unable to resolve EUI64 source address. Status: %d\r\n",
                        p_resp->status);
    }

    invalidate_ctx(p_tsn_ctx);
    ZB_FREE_BUF_BY_REF(param);
}

/**
 * @brief Handles timeout error and invalidates IEEE (EUI64) address request transaction.
 *
 * @param[in] param ZBOSS transaction sequence number.
 */
static void cmd_zb_ieee_addr_timeout(zb_uint8_t param)
{
    zdo_tsn_ctx_t * p_tsn_ctx = get_ctx_by_tsn(param);

    if (!p_tsn_ctx)
    {
        return;
    }

    print_error(p_tsn_ctx->p_cli, "IEEE address request timed out");
    invalidate_ctx(p_tsn_ctx);
}

/**
 * @brief A callback called on IEEE (EUI64) address response.
 *
 * @param[in] param Reference number to ZBOSS memory buffer.
 */
zb_void_t cmd_zb_ieee_addr_cb(zb_uint8_t param)
{
    zb_buf_t                * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_ieee_addr_resp_t * p_resp = (zb_zdo_ieee_addr_resp_t *)ZB_BUF_BEGIN(p_buf);
    zdo_tsn_ctx_t           * p_tsn_ctx;
    zb_ret_t                  zb_err_code;

    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    if (!p_tsn_ctx)
    {
        ZB_FREE_BUF_BY_REF(param);
        return;
    }

    zb_err_code = ZB_SCHEDULE_ALARM_CANCEL(cmd_zb_ieee_addr_timeout, ZB_ALARM_ANY_PARAM);
    if (zb_err_code != RET_OK)
    {
        print_error(p_tsn_ctx->p_cli, "Unable to cancel timeout timer");
    }

    if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
    {
        zb_address_ieee_ref_t addr_ref;
        zb_ieee_addr_t        ieee_addr;
        zb_uint16_t           nwk_addr;
        zb_ret_t              ret;

        ZB_LETOH64(ieee_addr, p_resp->ieee_addr_remote_dev);
        ZB_LETOH16(&nwk_addr, &(p_resp->nwk_addr_remote_dev));

        // Update local IEEE address resolution table.
        ret = zb_address_update(ieee_addr, nwk_addr, ZB_TRUE, &addr_ref);
        if (ret == RET_OK)
        {
            print_hexdump(p_tsn_ctx->p_cli,
                          (const uint8_t *)ieee_addr, sizeof(ieee_addr),
                          true);
            print_done(p_tsn_ctx->p_cli, ZB_TRUE);
        }
        else
        {
            nrf_cli_fprintf(p_tsn_ctx->p_cli,
                            NRF_CLI_ERROR,
                            "Failed to updated address table. Status: %d\r\n",
                            ret);
        }
    }
    else
    {
        nrf_cli_fprintf(p_tsn_ctx->p_cli,
                        NRF_CLI_ERROR,
                        "Error: Unable to resolve IEEE address. Status: %d\r\n",
                        p_resp->status);
    }

    invalidate_ctx(p_tsn_ctx);
    ZB_FREE_BUF_BY_REF(param);
}

/**
 * @brief Send Active Endpoint Request.
 *
 * @code
 * zdo active_ep <h:16-bit destination address> *
 * @endcode
 *
 * Send Active Endpoint Request to the node addressed by the short address.
 *
 * Example:
 * @code
 * > zdo active_ep 0xb4fc
 * > src_addr=B4FC ep=10,11,12
 * Done
 * @endcode
 *
 */
static void cmd_zb_active_ep(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    zb_zdo_active_ep_req_t    * p_req;
    zdo_tsn_ctx_t             * p_tsn_cli;
    zb_buf_t                  * p_buf;

    if ((argc == 1) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0],
                    "<h:16-bit destination address>\r\n");
        return;
    }

    if (argc != 2)
    {
        print_error(p_cli, "Incorrect number of arguments");
        return;
    }

    p_buf = ZB_GET_OUT_BUF();
    if (!p_buf)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        return;
    }

    ZB_BUF_INITIAL_ALLOC(p_buf, sizeof(*p_req), p_req);

    if (!sscanf(argv[1], "%hx", &(p_req->nwk_addr)))
    {
        print_error(p_cli, "Incorrect network address");
        goto error;
    }

    p_tsn_cli = get_free_ctx();
    if (!p_tsn_cli)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }

    p_tsn_cli->p_cli = p_cli;
    p_tsn_cli->tsn   = zb_zdo_active_ep_req(ZB_REF_FROM_BUF(p_buf),
                                            cmd_zb_active_ep_cb);

    if (p_tsn_cli->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send match descriptor request");
        goto error;
    }

    return;

error:
    ZB_FREE_BUF(p_buf);
}

/**
 * @brief Send Simple Descriptor Request.
 *
 * @code
 * zdo simple_desc_req <h:16-bit destination address> <d:endpoint>
 * @endcode
 *
 * Send Simple Descriptor Request to the given node and endpoint.
 *
 * Example:
 * @code
 * > zdo simple_desc_req 0xefba 10
 * > src_addr=0xEFBA ep=0x260 profile_id=0x0102 app_dev_id=0x0 app_dev_ver=0x5
 *   in_clusters=0x0000,0x0003,0x0004,0x0005,0x0006,0x0008,0x0300 out_clusters=0x0300
 * Done
 * @endcode
 *
 */
static void cmd_zb_simple_desc(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    zb_zdo_simple_desc_req_t * p_req;
    zdo_tsn_ctx_t            * p_tsn_cli;
    zb_buf_t                 * p_buf;

    if ((argc != 3) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0],
                    "<h:16-bit destination address> "
                    "<d:endpoint>\r\n");
        return;
    }

    p_buf = ZB_GET_OUT_BUF();
    if (!p_buf)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        return;
    }

    ZB_BUF_INITIAL_ALLOC(p_buf, sizeof(*p_req), p_req);

    if (!sscanf(argv[1], "%hx", &(p_req->nwk_addr)))
    {
        print_error(p_cli, "Invalid network address");
        goto error;
    }

    if (!sscan_uint8(argv[2], &(p_req->endpoint)))
    {
        print_error(p_cli, "Invalid endpoint");
        goto error;
    }

