KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    p_tsn_cli = get_free_ctx();
    if (!p_tsn_cli)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }

    p_tsn_cli->p_cli = p_cli;
    p_tsn_cli->is_broadcast = ZB_NWK_IS_ADDRESS_BROADCAST(p_req->nwk_addr);
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Sending %s request.\r\n", p_tsn_cli->is_broadcast ? "broadcast" : "unicast");
    p_tsn_cli->tsn   = zb_zdo_match_desc_req(ZB_REF_FROM_BUF(p_buf),
                                             cmd_zb_match_desc_cb);

    if (p_tsn_cli->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send match descriptor request");
        goto error;
    }

    if (use_timeout || !p_tsn_cli->is_broadcast)
    {
        /* In case of unicast we schedule callback to merely print the 'Done' thing if the response never comes.
         * The stack calls the callback function indicating the timeout only in case of broadcasts.
         * In case of unicast, we can treat the command as finished either when the timeout has elapsed, or when
         * the response has been received. With this in mind, we schedule the alarm with the timeout, which checks the context.
         * If the context has been deleted, then it means that it has been already freed by the response reception callback.
         */
        zb_err_code = ZB_SCHEDULE_ALARM(cmd_zb_match_desc_timeout,
                                        p_tsn_cli->tsn,
                                        timeout * ZB_TIME_ONE_SECOND);
        if (zb_err_code != RET_OK)
        {
            print_error(p_cli, "Unable to schedule timeout timer");
            invalidate_ctx(p_tsn_cli);
        }
    }

    return;

error:
    ZB_FREE_BUF(p_buf);
}

/**
 * @brief Create or remove a binding between two endpoints on two nodes.
 *
 * @code
 * zdo bind {on,off} <h:source eui64> <d:source ep> <h:destination eui64>
 *                   <d:destination ep> <h:source cluster id> <h:request dst addr>`
 * @endcode
 *
 * Create bound connection between a device identified by `source eui64` and
 * endpoint `source ep`, and a device identified by `destination eui64` and
 * endpoint `destination ep`. The connection is created for ZCL commands and
 * attributes assigned to the ZCL cluster `source cluster id` on the
 * `request dst addr` node (usually the same address as for the `source eui64` device).
 *
 * Example:
 * @code
 * zdo bind on 0B010E0405060708 1 0B010E4050607080 2 8
 * @endcode
 *
 */
static void cmd_zb_bind(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    zb_zdo_bind_req_param_t * p_req;
    zdo_tsn_ctx_t           * p_tsn_cli = NULL;
    zb_buf_t                * p_buf;
    zb_ret_t                  zb_err_code;
    zb_uint8_t                addr_mode;
    zb_bool_t                 bind;

    if (strcmp(argv[0], "on") == 0)
    {
        bind = ZB_TRUE;
    }
    else
    {
        bind = ZB_FALSE;
    }

    if ((argc == 1) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0],
                    "<h:source eui64> <d:source ep>\r\n"
                    "<h:destination eui64> <d:destination ep>\r\n"
                    "<h:source cluster id> <h:request dst addr>");
        return;
    }

    if (argc != 7)
    {
        print_error(p_cli, "Incorrect number of arguments");
        return;
    }

    p_buf = ZB_GET_OUT_BUF();
    if (!p_buf)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        return;
    }

    p_req = ZB_GET_BUF_PARAM(p_buf, zb_zdo_bind_req_param_t);

    if (parse_address_string(argv[1], (zb_addr_u*)(p_req->src_address), &addr_mode) == ZB_FALSE)
    {
        print_error(p_cli, "Incorrect EUI64 source address format");
        goto error;
    }

    if (addr_mode != ZB_APS_ADDR_MODE_64_ENDP_PRESENT)
    {
        print_error(p_cli, "Incorrect source address type");
        goto error;
    }

    if (!sscan_uint8(argv[2], &(p_req->src_endp)))
    {
        print_error(p_cli, "Incorrect source endpoint");
        goto error;
    }

    if (parse_address_string(argv[3], &(p_req->dst_address), &(p_req->dst_addr_mode)) == ZB_FALSE)
    {
        print_error(p_cli, "Incorrect EUI64 destination address format");
        goto error;
    }

    if (!sscan_uint8(argv[4], &(p_req->dst_endp)))
    {
        print_error(p_cli, "Incorrect destination endpoint");
        goto error;
    }

    if (!sscanf(argv[5], "%hx", &(p_req->cluster_id)))
    {
        print_error(p_cli, "Incorrect cluster ID");
        goto error;
    }

    if (!sscanf(argv[6], "%hx", &(p_req->req_dst_addr)))
    {
        print_error(p_cli, "Incorrect destination network address for the request");
        goto error;
    }

    p_tsn_cli = get_free_ctx();
    if (!p_tsn_cli)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }

    // Initialize context and send a request.
    p_tsn_cli->p_cli = p_cli;

    if (bind)
    {
        p_tsn_cli->tsn = zb_zdo_bind_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_bind_unbind_cb);
    }
    else
    {
        p_tsn_cli->tsn = zb_zdo_unbind_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_bind_unbind_cb);
    }

    if (p_tsn_cli->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send request");
        goto error;
    }

    zb_err_code = ZB_SCHEDULE_ALARM(cmd_zb_bind_unbind_timeout,
                                    p_tsn_cli->tsn,
                                    ZIGBEE_CLI_BIND_RESP_TIMEOUT * ZB_TIME_ONE_SECOND);
    if (zb_err_code != RET_OK)
    {
        print_error(p_cli, "Unable to schedule timeout timer");
        invalidate_ctx(p_tsn_cli);
    }

    return;

error:
    if (p_tsn_cli != NULL)
    {
        invalidate_ctx(p_tsn_cli);
    }
    ZB_FREE_BUF(p_buf);
}

/**
 * @brief Resolve eui64 address to a short network address.
 *
 * @code
 * zdo nwk_addr <h:eui64>
 * @endcode
 *
 * Example:
 * @code
 * zdo nwk_addr 0B010E0405060708
 * @endcode
 *
 */
static void cmd_zb_nwk_addr(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    zb_zdo_nwk_addr_req_param_t * p_req;
    zdo_tsn_ctx_t               * p_tsn_cli = NULL;
    zb_buf_t                    * p_buf;
    zb_ret_t                      zb_err_code;
    zb_uint8_t                    addr_mode;

    if ((argc == 1) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0], "<h:EUI64>");
        return;
    }

    if (argc != 2)
    {
        print_error(p_cli, "Incorrect number of arguments");
        return;
    }

    p_buf = ZB_GET_OUT_BUF();
    if (!p_buf)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        return;
    }

    p_req = ZB_GET_BUF_PARAM(p_buf, zb_zdo_nwk_addr_req_param_t);

    if (parse_address_string(argv[1], (zb_addr_u*)(p_req->ieee_addr), &addr_mode) == ZB_FALSE)
    {
        print_error(p_cli, "Incorrect EUI64 address format");
        goto error;
    }

    if (addr_mode != ZB_APS_ADDR_MODE_64_ENDP_PRESENT)
    {
        print_error(p_cli, "Incorrect source address type");
        goto error;
    }

