KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    p_tsn_cli = get_free_ctx();
    if (!p_tsn_cli)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }

    // Construct network address request.
    p_req->dst_addr     = ZB_NWK_BROADCAST_ALL_DEVICES;
    p_req->request_type = ZB_ZDO_SINGLE_DEVICE_RESP;
    p_req->start_index  = 0;

    // Initialize context and send a request.
    p_tsn_cli->p_cli = p_cli;
    p_tsn_cli->tsn   = zb_zdo_nwk_addr_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_nwk_addr_cb);
    if (p_tsn_cli->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send request");
        goto error;
    }

    zb_err_code = ZB_SCHEDULE_ALARM(cmd_zb_nwk_addr_timeout,
                                    p_tsn_cli->tsn,
                                    ZIGBEE_CLI_NWK_ADDR_RESP_TIMEOUT * ZB_TIME_ONE_SECOND);
    if (zb_err_code != RET_OK)
    {
        print_error(p_cli, "Unable to schedule timeout timer");
        invalidate_ctx(p_tsn_cli);
    }

    return;

error:
    if (p_tsn_cli != NULL)
    {
        invalidate_ctx(p_tsn_cli);
    }
    ZB_FREE_BUF(p_buf);
}

/**
 * @brief Resolve EUI64 by sending IEEE address request.
 *
 * @code
 * zdo ieee_addr <h:short_addr>
 * @endcode
 *
 */
static void cmd_zb_ieee_addr(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    zb_zdo_ieee_addr_req_t * p_req;
    zdo_tsn_ctx_t          * p_tsn_cli = NULL;
    zb_buf_t               * p_buf;
    zb_ret_t                 zb_err_code;

    if ((argc == 1) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0],
                    "<h:short address>");
        return;
    }

    if (argc != 2)
    {
        print_error(p_cli, "Incorrect number of arguments");
        return;
    }

    p_buf = ZB_GET_OUT_BUF();
    if (!p_buf)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        return;
    }

    // Create new IEEE address request and fill with default values.
    ZB_BUF_INITIAL_ALLOC(p_buf, sizeof(zb_zdo_ieee_addr_req_t), p_req);
    p_req->start_index  = 0;
    p_req->request_type = 0;

    if (!sscanf(argv[1], "%hx", &(p_req->nwk_addr)))
    {
        print_error(p_cli, "Incorrect network address");
        goto error;
    }

    p_tsn_cli = get_free_ctx();
    if (!p_tsn_cli)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }

    // Initialize context and send a request.
    p_tsn_cli->p_cli = p_cli;
    p_tsn_cli->tsn   = zb_zdo_ieee_addr_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_ieee_addr_cb);
    if (p_tsn_cli->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send request");
        goto error;
    }

    zb_err_code = ZB_SCHEDULE_ALARM(cmd_zb_ieee_addr_timeout,
                                    p_tsn_cli->tsn,
                                    ZIGBEE_CLI_IEEE_ADDR_RESP_TIMEOUT * ZB_TIME_ONE_SECOND);
    if (zb_err_code != RET_OK)
    {
        print_error(p_cli, "Unable to schedule timeout timer");
        invalidate_ctx(p_tsn_cli);
    }

    return;

error:
    if (p_tsn_cli != NULL)
    {
        invalidate_ctx(p_tsn_cli);
    }
    ZB_FREE_BUF(p_buf);
}

/**
 * @brief Get the short 16-bit address of the Zigbee device.
 *
 * @code
 * > zdo short
 * 0000
 * Done
 * @endcode
 */
static void cmd_zb_short(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    UNUSED_PARAMETER(argv);

    zb_ieee_addr_t addr;
    zb_uint16_t short_addr;
    int i;

    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc != 1)
    {
        print_error(p_cli, "Incorrect number of arguments");
        return;
    }

    zb_get_long_address(addr);

    short_addr = zb_address_short_by_ieee(addr);
    if (short_addr != ZB_UNKNOWN_SHORT_ADDR)
    {
        /* We got a valid address */
        for (i = sizeof(zb_uint16_t) - 1; i >= 0; i--)
        {
            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%02x", *((zb_uint8_t*)(&short_addr) + i));
        }

        print_done(p_cli, ZB_TRUE);
    }
    else
    {
        /* Most probably there was no network to join */
        print_error(p_cli, "Check if device was commissioned\r\n");
    }
}

/**
 * @brief Get or set the EUI64 address of the Zigbee device.
 *
 * @code
 * > zdo eui64 [<h:eui64>]
 * 0b010eaafd745dfa
 * Done
 * @endcode
 */
static void cmd_zb_eui64(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    zb_ieee_addr_t addr;
    zb_uint8_t     addr_mode;

    UNUSED_PARAMETER(argv);

    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        print_error(p_cli, "Incorrect number of arguments");
        return;
    }

    if (argc == 2)
    {
        if ((parse_address_string(argv[1], (zb_addr_u*)(addr), &addr_mode) == ZB_TRUE) &&
            (addr_mode == ZB_APS_ADDR_MODE_64_ENDP_PRESENT))
        {
            zb_set_long_address(addr);
        }
        else
        {
            print_error(p_cli, "Incorrect EUI64 address format");
        }
    }
    else
    {
        zb_get_long_address(addr);
    }

    print_hexdump(p_cli, (const uint8_t *)addr, sizeof(addr), true);
    print_done(p_cli, ZB_TRUE);
}

/**
 * @brief Callback called, when mgmt_leave operation takes too long
 * @param param[in] tsn value obtained as result of zdo_mgmt_leave_req, transaction sequence number
 */
static void cmd_zb_mgmt_leave_timeout_cb(zb_uint8_t param)
{
    zdo_tsn_ctx_t * p_tsn_ctx = get_ctx_by_tsn(param);

    if (p_tsn_ctx == NULL)
    {
        return;
    }

    print_error(p_tsn_ctx->p_cli, "mgmt_leave request timed out");

    invalidate_ctx(p_tsn_ctx);
}

/**
 * @brief Callback called when response to mgmt_leave is received
 * @param param[in] zboss buffer reference
 */
static void cmd_zb_mgmt_leave_cb(uint8_t param)
{
    zb_buf_t                * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_mgmt_leave_res_t * p_resp = (zb_zdo_mgmt_leave_res_t*)ZB_BUF_BEGIN(p_buf);
    zdo_tsn_ctx_t           * p_tsn_ctx;

