KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    if (p_tsn_ctx != NULL)
    {
        zb_ret_t zb_err_code;

        zb_err_code = ZB_SCHEDULE_ALARM_CANCEL(cmd_zb_mgmt_leave_timeout_cb, p_resp->tsn);
        if (zb_err_code != RET_OK)
        {
            print_error(p_tsn_ctx->p_cli, "Unable to cancel timeout timer");
        }

        if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
        {
            print_done(p_tsn_ctx->p_cli, ZB_TRUE);
        }
        else
        {
            nrf_cli_fprintf(p_tsn_ctx->p_cli,
                            NRF_CLI_ERROR,
                            "Error: Unable to remove device. Status: %u\r\n",
                            (uint32_t)p_resp->status);
        }

        invalidate_ctx(p_tsn_ctx);
    }

    ZB_FREE_BUF_BY_REF(param);
}

/**
 * @brief Parses command line arguments for zdo mgmt_leave comand
 * @param p_req[out]    Request do be filled in according to command line arguments
 * @param p_cli[in]     Pointer to cli instance, used to produce errors if neccessary
 * @param argc[in]      Number of arguments in argv
 * @param argv[in]      Arguments from cli to the command
 * @return true, if arguments were parsed correctly and p_req has been filled up <br>
 *         false, if arguments were incorrect
 *
 * @sa @ref cmd_zb_mgmt_leave
 */
static bool cmd_zb_mgmt_leave_parse(zb_zdo_mgmt_leave_param_t *p_req, const nrf_cli_t *p_cli, size_t argc, char **argv)
{
    size_t arg_idx;

    ZB_MEMSET(p_req, 0, sizeof(*p_req));

    arg_idx = 1U;   /* Let it be index of the first argument to parse */
    if (arg_idx >= argc)
    {
        print_error(p_cli, "Lack of dst_addr parameter");
        return false;
    }
    if (sscanf(argv[arg_idx], "%hx", &(p_req->dst_addr)) != 1)
    {
        print_error(p_cli, "Incorrect dst_addr");
        return false;
    }
    arg_idx++;

    /* Try parse device_address */
    if (arg_idx < argc)
    {
        const char *curr_arg = argv[arg_idx];
        if (curr_arg[0] != '-')
        {
            zb_addr_u parsed_address;
            zb_uint8_t parsed_address_mode = ZB_APS_ADDR_MODE_DST_ADDR_ENDP_NOT_PRESENT;
            if (parse_address_string(curr_arg, &parsed_address, &parsed_address_mode) &&
                (parsed_address_mode == ZB_APS_ADDR_MODE_64_ENDP_PRESENT))
            {
                ZB_IEEE_ADDR_COPY(p_req->device_address, parsed_address.addr_long);
            }
            else
            {
                print_error(p_cli, "Incorrect device_address");
                return false;
            }

            arg_idx++;
        }
        else
        {
            /* No device_address field */
        }
    }

    /* Parse optional fields */
    while (arg_idx < argc)
    {
        const char *curr_arg = argv[arg_idx];
        if (strcmp(curr_arg, "--children") == 0)
        {
            p_req->remove_children = ZB_TRUE;
        }
        else if (strcmp(curr_arg, "--rejoin") == 0)
        {
            p_req->rejoin = ZB_TRUE;
        }
        else
        {
            print_error(p_cli, "Incorrect argument");
            return false;
        }
        arg_idx++;
    }


    return true;
}

/**
 * @brief Send a request to a remote device in order to leave network through zdo mgmt_leave_req (see spec. 2.4.3.3.5)
 *
 * @code
 * zdo mgmt_leave <h:16-bit dst_addr> [h:device_address eui64] [--children] [--rejoin]
 * @endcode
 *
 * Send @c mgmt_leave_req to a remote node specified by @c dst_addr. If @c device_address is omitted
 * or it has value @c 0000000000000000, the remote device at address @c dst_addr will remove itself
 * from the network. If @c device_address has other value, it must be a long address corresponding
 * to @c dst_addr or a long address of child node of @c dst_addr.
 * The request is sent with <em>Remove Children</em> and <em>Rejoin</em> flags set to @c 0 by default. Use options
 * @c \--children or @c \--rejoin do change respective flags to @c 1.
 * For more details, see section 2.4.3.3.5 of the specification.
 *
 * Examples:
 * @code
 * zdo mgmt_leave 0x1234
 * @endcode
 * Sends @c mgmt_leave_req to the device with short address @c 0x1234, asking it to remove itself from the network. @n
 * @code
 * zdo mgmt_leave 0x1234 --rejoin
 * @endcode
 * Sends @c mgmt_leave_req to device with short address @c 0x1234, asking it to remove itself from the network and perform rejoin.@n
 * @code
 * zdo mgmt_leave 0x1234 0b010ef8872c633e
 * @endcode
 * Sends @c mgmt_leave_req to device with short address @c 0x1234, asking it to remove device @c 0b010ef8872c633e from the network.
 * If the target device with short address @c 0x1234 has also a long address @c 0b010ef8872c633e, it will remove itself from the network
 * If the target device with short address @c 0x1234 has a child with long address @c 0b010ef8872c633e, it will remove the child from the network.@n
 * @code
 * zdo mgmt_leave 0x1234 --children
 * @endcode
 * Sends @c mgmt_leave_req to the device with short address @c 0x1234, asking it to remove itself and all its children from the network.@n
 */
static void cmd_zb_mgmt_leave(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    if ((argc == 1) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0],
                    "<h:16-bit dst_addr> [h:device_address eui64] [--children]\r\n"
                    "[--rejoin]"
                );
        return;
    }

    zb_buf_t      * p_buf     = NULL;
    zdo_tsn_ctx_t * p_tsn_cli = NULL;

    p_buf = ZB_GET_OUT_BUF();
    if (p_buf == NULL)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        goto error;
    }

    zb_zdo_mgmt_leave_param_t req;
    if (!cmd_zb_mgmt_leave_parse(&req, p_cli, argc, argv))
    {
        /* The error message has already been printed by cmd_zb_mgmt_leave_parse */
        goto error;
    }

    ZB_SET_BUF_PARAM(p_buf, req, zb_zdo_mgmt_leave_param_t);

    p_tsn_cli = get_free_ctx();
    if (p_tsn_cli == NULL)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }

    p_tsn_cli->p_cli = p_cli;
    p_tsn_cli->tsn = zdo_mgmt_leave_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_mgmt_leave_cb);
    if (p_tsn_cli->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send request");
        goto error;
    }

    zb_ret_t zb_err_code;
    zb_err_code = ZB_SCHEDULE_ALARM(cmd_zb_mgmt_leave_timeout_cb,
                                    p_tsn_cli->tsn,
                                    ZIGBEE_CLI_MGMT_LEAVE_RESP_TIMEOUT * ZB_TIME_ONE_SECOND);
    if (zb_err_code != RET_OK)
    {
        print_error(p_cli, "Unable to schedule timeout timer");
        invalidate_ctx(p_tsn_cli);
    }

    return;
error:
    if (p_buf != NULL)
    {
        ZB_FREE_BUF(p_buf);
    }
    if (p_tsn_cli != NULL)
    {
        invalidate_ctx(p_tsn_cli);
    }
}

/**@brief Prints one binding table record.
 * @param[out] p_cli     The CLI the output is printed to.
 * @param[in]  idx       Record index in binding table.
 * @param[in]  p_record  Record to be printed out.
 */
static void print_bind_resp_record(const nrf_cli_t * p_cli, uint32_t idx, const zb_zdo_binding_table_record_t * p_record)
{
    char ieee_address_str[sizeof(p_record->src_address)*2U + 1U];

    if (ieee_addr_to_str(ieee_address_str, sizeof(ieee_address_str), p_record->src_address) <= 0)
    {
        strcpy(ieee_address_str, "(error)         ");
    }
    ieee_address_str[sizeof(ieee_address_str)-1U] = '\0';   // Ensure null-terminated string

    /* Note: Fields in format string are scattered to match position in the header, printed by print_bind_resp_records_header */
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL,
                    "[%3u] %s      %3u     0x%04x",
                    (uint32_t)idx,
                    ieee_address_str,
                    (uint32_t)p_record->src_endp,
                    (uint32_t)p_record->cluster_id);

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL,
                    "           %3u ",
                    (uint32_t)p_record->dst_addr_mode);

