KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    switch (p_record->dst_addr_mode)
    {
        case ZB_APS_ADDR_MODE_16_GROUP_ENDP_NOT_PRESENT:     /* 16-bit group address for DstAddress and DstEndp not present */
            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "          0x%4x      N/A",
                    (uint32_t)p_record->dst_address.addr_short);
            break;

        case ZB_APS_ADDR_MODE_64_ENDP_PRESENT:     /* 64-bit extended address for DstAddress and DstEndp present */
            if (ieee_addr_to_str(ieee_address_str, sizeof(ieee_address_str), p_record->dst_address.addr_long) <= 0)
            {
                strcpy(ieee_address_str, "(error)         ");
            }
            ieee_address_str[sizeof(ieee_address_str)-1U] = '\0';   // Ensure null-terminated string

            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL,
                    "%s      %3u",
                    ieee_address_str,
                    (uint32_t)p_record->dst_endp);
            break;

        default:
            /* This should not happen, as the above case values are the only ones allowed by Zigbee r21 specification */
            nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "            N/A      N/A");
            break;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "\n");
}

/**@brief   Prints header for binding records table
 * @param[out] p_cli    The CLI the output is printed to.
 */
static void print_bind_resp_records_header(const nrf_cli_t * p_cli)
{
    /* Note: Position of fields matches corresponding fields printed by print_bind_resp_record */
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL,
            "\n[idx] src_address      src_endp cluster_id dst_addr_mode dst_addr         dst_endp\n");
}

/**@brief   Prints records of binding table received from zdo_mgmt_bind_resp
 * @param[out] p_cli    The CLI the output is printed to.
 * @param[in]  p_resp   Response received from remote device to be printed out
 *
 * @note Records of type @ref zb_zdo_binding_table_record_t are located just after
 * the @ref zb_zdo_mgmt_bind_resp_t structure pointed by p_resp parameter.
 */
static void print_bind_resp(const nrf_cli_t * p_cli, const zb_zdo_mgmt_bind_resp_t * p_resp)
{
    uint32_t next_start_index = (uint32_t)p_resp->start_index + p_resp->binding_table_list_count;

    const zb_zdo_binding_table_record_t *p_record;
    p_record = (const zb_zdo_binding_table_record_t *)(p_resp + 1);
    for (uint32_t idx = p_resp->start_index; idx < next_start_index; ++idx, ++p_record)
    {
        print_bind_resp_record(p_cli, idx, p_record);
    }
}

/**@brief Callback terminating single mgmt_bind_req transaction
 * @note
 * When the binding table is too large to fit into a single mgmt_bind_rsp command frame, this function
 * will issue a new mgmt_bind_req_t with start_index increased by the number of just received entries to
 * download remaining part of the binding table. This process may involve several round trips of
 * mgmt_bind_req followed by mgmt_bind_rsp until the whole binding table is downloaded.
 *
 * @param param     Reference to buffer (as required by Zigbee stack API)
 */
static void cmd_zb_mgmt_bind_cb(uint8_t param)
{
    zb_buf_t                * p_buf  = ZB_BUF_FROM_REF(param);
    zb_zdo_mgmt_bind_resp_t * p_resp = (zb_zdo_mgmt_bind_resp_t*)ZB_BUF_BEGIN(p_buf);
    zdo_tsn_ctx_t           * p_tsn_ctx;

    p_tsn_ctx = get_ctx_by_tsn(p_resp->tsn);
    if (p_tsn_ctx != NULL)
    {
        if (p_resp->status == ZB_ZDP_STATUS_SUCCESS)
        {
            if ((p_resp->binding_table_list_count != 0U) && !(p_tsn_ctx->cmd_ctx.mgmt_bind.header_printed))
            {
                print_bind_resp_records_header(p_tsn_ctx->p_cli);
                p_tsn_ctx->cmd_ctx.mgmt_bind.header_printed = true;
            }
            print_bind_resp(p_tsn_ctx->p_cli, p_resp);

            uint32_t next_start_index = p_resp->start_index;
            next_start_index += p_resp->binding_table_list_count;

            if ((next_start_index < p_resp->binding_table_entries) &&
                (next_start_index < 0xFFU) &&
                (p_resp->binding_table_list_count != 0U))
            {
                /* We have more entries to get */
                p_tsn_ctx->cmd_ctx.mgmt_bind.zb_zdo_mgmt_bind_param.start_index = next_start_index;

                ZB_BUF_REUSE(p_buf);
                ZB_SET_BUF_PARAM(p_buf, p_tsn_ctx->cmd_ctx.mgmt_bind.zb_zdo_mgmt_bind_param, zb_zdo_mgmt_bind_param_t);

                p_tsn_ctx->tsn = zb_zdo_mgmt_bind_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_mgmt_bind_cb);
                if (p_tsn_ctx->tsn == ZB_ZDO_INVALID_TSN)
                {
                    print_error(p_tsn_ctx->p_cli, "Failed to send request");
                    goto finish;
                }

                p_buf = NULL;   /* p_buf reused, mark NULL not to free it */
                p_tsn_ctx = NULL;   /* p_tsn_ctx reused, mark NULL not to free it */
            }
            else
            {
                nrf_cli_fprintf(p_tsn_ctx->p_cli, NRF_CLI_NORMAL, "Total entries for the binding table: %u",
                        (uint32_t)p_resp->binding_table_entries);
                print_done(p_tsn_ctx->p_cli, ZB_TRUE);
            }
        }
        else
        {
            nrf_cli_fprintf(p_tsn_ctx->p_cli,
                            NRF_CLI_ERROR,
                            "Error: Unable to get binding table. Status: %u\r\n",
                            (uint32_t)p_resp->status);
        }
    }

finish:
    if (p_buf != NULL)
    {
        ZB_FREE_BUF(p_buf);
    }

    if (p_tsn_ctx != NULL)
    {
        invalidate_ctx(p_tsn_ctx);
    }
}

/**
 * @brief Send a request to a remote device in order to read the binding table through zdo mgmt_bind_req (see spec. 2.4.3.3.4)
 *
 * @note If whole binding table does not fit into single @c mgmt_bind_resp frame, the request initiates a series of
 * requests performing full binding table download.
 *
 * @code
 * zdo mgmt_bind <h:16-bit dst_addr> [d:start_index]
 * @endcode
 *
 * Example:
 * @code
 * zdo mgmt_bind 0x1234
 * @endcode
 * Sends @c mgmt_bind_req to the device with short address @c 0x1234, asking it to return its binding table.
 */
static void cmd_zb_mgmt_bind(nrf_cli_t const * p_cli, size_t argc, char **argv)
{
    size_t arg_idx = 1U;

    if ((argc == 1) || (nrf_cli_help_requested(p_cli)))
    {
        print_usage(p_cli, argv[0],
                    "<h:16-bit dst_addr> [d:start_index]");
        return;
    }

    zdo_tsn_ctx_t * p_tsn_ctx = NULL;
    zb_buf_t      * p_buf     = NULL;

    p_tsn_ctx = get_free_ctx();
    if (p_tsn_ctx == NULL)
    {
        print_error(p_cli, "Too many ZDO transactions");
        goto error;
    }
    p_tsn_ctx->p_cli = p_cli;

    ZB_BZERO(&(p_tsn_ctx->cmd_ctx.mgmt_bind), sizeof(p_tsn_ctx->cmd_ctx.mgmt_bind));
    p_tsn_ctx->cmd_ctx.mgmt_bind.header_printed = false;

