KunYi/nRF5_SDK_Thread/components/zigbee/cli/zigbee_cli_cmd_zdo.c
    if (arg_idx < argc)
    {
        if (sscanf(argv[arg_idx], "%hx", &(p_tsn_ctx->cmd_ctx.mgmt_bind.zb_zdo_mgmt_bind_param.dst_addr)) != 1)
        {
            print_error(p_cli, "Incorrect dst_addr");
            goto error;
        }
        arg_idx++;
    }
    else
    {
        print_error(p_cli, "dst_addr parameter missing");
        goto error;
    }

    if (arg_idx < argc)
    {
        unsigned int tmp = UINT_MAX;
        if ((sscanf(argv[arg_idx], "%u", &tmp) != 1) || (tmp > 0xFFU))
        {
            print_error(p_cli, "Incorrect start_index");
            goto error;
        }
        p_tsn_ctx->cmd_ctx.mgmt_bind.zb_zdo_mgmt_bind_param.start_index = tmp;
        arg_idx++;
    }
    else
    {
        /* This parameter was optional, no error */
    }

    if (arg_idx < argc)
    {
        print_error(p_cli, "Unexpected extra parameters");
        goto error;
    }

    p_buf = ZB_GET_OUT_BUF();
    if (p_buf == NULL)
    {
        print_error(p_cli, "Failed to execute command (buf alloc failed)");
        goto error;
    }

    ZB_SET_BUF_PARAM(p_buf, p_tsn_ctx->cmd_ctx.mgmt_bind.zb_zdo_mgmt_bind_param, zb_zdo_mgmt_bind_param_t);

    p_tsn_ctx->tsn = zb_zdo_mgmt_bind_req(ZB_REF_FROM_BUF(p_buf), cmd_zb_mgmt_bind_cb);
    if (p_tsn_ctx->tsn == ZB_ZDO_INVALID_TSN)
    {
        print_error(p_cli, "Failed to send request");
        goto error;
    }

    return;
error:
    if (p_buf != NULL)
    {
        ZB_FREE_BUF(p_buf);
    }
    if (p_tsn_ctx != NULL)
    {
        invalidate_ctx(p_tsn_ctx);
    }
}

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_bind)
{
    NRF_CLI_CMD(on, NULL, "create bind entry", cmd_zb_bind),
    NRF_CLI_CMD(off, NULL, "remove bind entry", cmd_zb_bind),
    NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_zdo)
{
    NRF_CLI_CMD(active_ep, NULL, "send active endpoint request", cmd_zb_active_ep),
    NRF_CLI_CMD(simple_desc_req, NULL, "send simple descriptor request", cmd_zb_simple_desc),
    NRF_CLI_CMD(match_desc, NULL, "send match descriptor request", cmd_zb_match_desc),
    NRF_CLI_CMD(nwk_addr, NULL, "resolve EUI64 address to short network address", cmd_zb_nwk_addr),
    NRF_CLI_CMD(ieee_addr, NULL, "resolve network short address to EUI64 address", cmd_zb_ieee_addr),
    NRF_CLI_CMD(eui64, NULL, "get the eui64 address of the node", cmd_zb_eui64),
    NRF_CLI_CMD(short, NULL, "get the short address of the node", cmd_zb_short),
    NRF_CLI_CMD(bind, &m_sub_bind, "create or remove the binding entry in the remote node", NULL),
    NRF_CLI_CMD(mgmt_bind, NULL, "get binding table (see spec. 2.4.3.3.4)", cmd_zb_mgmt_bind),
    NRF_CLI_CMD(mgmt_leave, NULL, "perform mgmt_leave_req (see spec. 2.4.3.3.5)", cmd_zb_mgmt_leave),
    NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CMD_REGISTER(zdo, &m_sub_zdo, "ZDO manipulation", NULL);


/** @} */
